# -*- coding: cp1251 -*-
import string

import requests
from random import randint, choice

names_m = ['Фёдор', 'Рустам', 'Алексей', 'Николай', 'Роман', 'Леонид', 'Константин', 'Эльдар', 'Эрик', 'Роберт', 'Кирилл', 'Назар', 'Семён', 'Ринат', 'Азамат', 'Геннадий', 'Артур', 'Михаил', 'Анатолий', 'Олег', 'Максим', 'Ильдар', 'Иван', 'Владислав', 'Григорий', 'Захар', 'Руслан', 'Андрей', 'Марк', 'Борис', 'Егор', 'Святослав', 'Азат', 'Никита', 'Павел', 'Эдуард', 'Ярослав', 'Александр', 'Даниил', 'Игорь', 'Вячеслав', 'Тимофей', 'Арсений', 'Альберт', 'Денис', 'Тарас', 'Вадим', 'Степан', 'Антон', 'Георгий', 'Владимир', 'Богдан', 'Аркадий', 'Сергей', 'Дмитрий', 'Юрий', 'Рашид', 'Глеб', 'Виктор', 'Филипп', 'Евгений', 'Герман', 'Илья', 'Яков', 'Валентин', 'Марат', '1', 'Валерий', 'Виталий', 'Василий', '0', 'Артём', 'Давид', 'Станислав', 'Эмиль', 'Пётр']
names_w = ['Ольга', 'Дана', 'Анастасия', 'Майя', 'Таисия', 'Каролина', 'Марьяна', 'Нелли', 'Ева', 'Ксения', 'Алия', 'Элина', 'Альбина', 'Любовь', 'Дарья', 'Александра', 'Олеся', 'Надежда', 'Инна', 'Маргарита', 'Иванна', 'Вероника', 'Екатерина', 'Марта', 'Анна', 'Алина', 'Изабелла', 'Римма', 'Зоя', 'Инга', 'Нонна', 'Виталия', 'Диана', 'Людмила', 'Лолита', 'Мадина', 'Виолетта', 'Василиса', 'Нина', 'Снежана', 'Эльвира', 'Гузель', 'Руслана', 'Полина', 'Лилия', 'Гульнара', 'Жанна', 'Алиса', 'Евгения', 'Лина', 'Мирослава', 'Зарина', 'Елизавета', 'Регина', 'Лиана', 'Раиса', 'Алёна', 'Вера', 'Светлана', 'Мила', 'Ася', 'Варвара', 'Милена', 'Юлия', 'Зинаида', 'Яна', 'Наталья', 'Инесса', 'Оксана', 'Карина', 'Милана', 'Мария', 'Кристина', 'Софья', 'Виктория', 'Ульяна', 'Камилла', 'Леся', 'Лидия', 'Алла', 'Галина', 'Сабина', 'Земфира', 'Алевтина', 'Валерия', 'Елена', 'Кира', 'Лариса', 'Дина', 'Анжелика', 'Марина', 'Алсу', 'Арина', 'Роза', 'Ангелина', 'Тамара', 'Динара', 'Ирина', 'Антонина', 'Владислава', 'Татьяна', 'Валентина', 'Марианна', 'Илона']
last_names = ['Носков', 'Лаврентьев', 'Дементьев', 'Морозов', 'Лобанов', 'Суворов', 'Галкин', 'Фадеев', 'Федотов', 'Александров', 'Семёнов', 'Афанасьев', 'Калашников', 'Миронов', 'Комиссаров', 'Туров', 'Андреев', 'Шубин', 'Большаков', 'Емельянов', 'Максимов', 'Комаров', 'Ковалёв', 'Поляков', 'Маслов', 'Назаров', 'Евдокимов', 'Кириллов', 'Князев', 'Буров', 'Блохин', 'Самсонов', 'Козлов', 'Лапин', 'Игнатов', 'Макаров', 'Сорокин', 'Никонов', 'Воронцов', 'Гусев', 'Уваров', 'Котов', 'Захаров', 'Панов', 'Селиверстов', 'Зимин', 'Артемьев', 'Щукин', 'Рогов', 'Савин', 'Сергеев', 'Копылов', 'Анисимов', 'Крылов', 'Прохоров', 'Гурьев', 'Ширяев', 'Терентьев', 'Меркушев', 'Ефимов', 'Гришин', 'Субботин', 'Овчинников', 'Дроздов', 'Красильников', 'Сидоров', 'Капустин', 'Борисов', 'Абрамов', 'Романов', 'Марков', 'Костин', 'Соколов', 'Зайцев', 'Медведев', 'Кошелев', 'Данилов', 'Исаев', 'Муравьёв', 'Мамонтов', 'Дмитриев', 'Пономарёв', 'Громов', 'Рыбаков', 'Лукин', 'Логинов', 'Одинцов', 'Филатов', 'Тетерин', 'Кулагин', 'Куликов', 'Яковлев', 'Мельников', 'Цветков', 'Филиппов', 'Кузнецов', 'Тихонов', 'Зуев', 'Фролов', 'Самойлов', 'Юдин', 'Михайлов', 'Игнатьев', 'Павлов', 'Бирюков', 'Панфилов', 'Мишин', 'Егоров', 'Казаков', 'Васильев', 'Колесников', 'Мухин', 'Мартынов', 'Герасимов', 'Волков', 'Дьячков', 'Богданов', 'Русаков', 'Киселёв', 'Кудряшов', 'Петухов', 'Шилов', 'Мясников', 'Матвеев', 'Савельев', 'Ефремов', 'Пестов', 'Николаев', 'Калинин', 'Кудрявцев', 'Симонов', 'Крюков', 'Смирнов', 'Соловьёв', 'Зиновьев', 'Новиков', 'Наумов', 'Белоусов', 'Щербаков', 'Шестаков', 'Жуков', 'Селезнёв', 'Кононов', 'Кулаков', 'Королёв', 'Нестеров', 'Ильин', 'Некрасов', 'Бобылёв', 'Рожков', 'Лазарев', 'Доронин', 'Потапов', 'Чернов', 'Никитин', 'Фёдоров', 'Исаков', 'Сысоев', 'Горшков', 'Коновалов', 'Харитонов', 'Ермаков', 'Карпов', 'Антонов', 'Сазонов', 'Хохлов', 'Никифоров', 'Фокин', 'Быков', 'Журавлёв', 'Дорофеев', 'Бобров', 'Сафонов', 'Авдеев', 'Орлов', 'Елисеев', 'Лихачёв', 'Алексеев', 'Носов', 'Григорьев', 'Беляков', 'Орехов', 'Воробьёв', 'Беспалов', 'Пахомов', 'Белов', 'Фомин', 'Евсеев', 'Кузьмин', 'Горбунов', 'Кондратьев', 'Баранов', 'Давыдов', 'Аксёнов', 'Михеев', 'Кабанов', 'Молчанов', 'Константинов', 'Титов', 'Жданов', 'Лыткин', 'Владимиров', 'Шашков', 'Ларионов', 'Белозёров', 'Веселов', 'Гаврилов', 'Блинов', 'Гуляев', 'Якушев', 'Трофимов', 'Корнилов', 'Шаров', 'Воронов', 'Степанов', 'Устинов', 'Федосеев', 'Горбачёв', 'Гордеев', 'Зыков', 'Брагин', 'Попов', 'Моисеев', 'Шарапов', 'Беляев', 'Голубев', 'Архипов', 'Осипов', 'Власов', 'Соболев', 'Гущин', 'Иванов', 'Фомичёв', 'Суханов', 'Ершов', 'Вишняков', 'Агафонов', 'Колобов', 'Петров', 'Виноградов', 'Рябов', 'Денисов', 'Третьяков', 'Силин', 'Тимофеев', 'Лебедев', 'Тарасов', 'Родионов', 'Ситников', 'Стрелков']
partronymics_m = ['Александрович', 'Алексеевич', 'Анатольевич', 'Андреевич', 'Антонович', 'Аркадьевич', 'Арсеньевич', 'Артемович', 'Афанасьевич', 'Богданович', 'Борисович', 'Вадимович', 'Валентинович', 'Валериевич', 'Васильевич', 'Викторович', 'Витальевич', 'Владимирович', 'Всеволодович', 'Вячеславович', 'Гаврилович', 'Геннадиевич', 'Георгиевич', 'Глебович', 'Григорьевич', 'Давыдович', 'Данилович', 'Денисович', 'Дмитриевич', 'Евгеньевич', 'Егорович', 'Емельянович', 'Ефимович', 'Иванович', 'Игоревич', 'Ильич', 'Иосифович', 'Кириллович', 'Константинович', 'Корнеевич', 'Леонидович', 'Львович', 'Макарович', 'Максимович', 'Маркович', 'Матвеевич', 'Митрофанович', 'Михайлович', 'Назарович', 'Наумович', 'Николаевич', 'Олегович', 'Павлович', 'Петрович', 'Платонович', 'Робертович', 'Родионович', 'Романович', 'Савельевич', 'Семенович', 'Сергеевич', 'Станиславович', 'Степанович', 'Тарасович', 'Тимофеевич', 'Тихонович', 'Федорович', 'Феликсович', 'Филиппович', 'Эдуардович', 'Юрьевич', 'Яковлевич', 'Ярославович']
partronymics_w = ['Александровна', 'Алексеевна', 'Анатольевна', 'Андреевна', 'Антоновна', 'Аркадьевна', 'Арсеньевна', 'Артемовна', 'Афанасьевна', 'Богданова', 'Борисовна', 'Вадимова', 'Валентиновна', 'Валериевна', 'Васильевна', 'Викторовна', 'Витальевна', 'Владимировна', 'Всеволодовна', 'Вячеславовна', 'Гаврилова', 'Геннадиевна', 'Георгиевна', 'Глебова', 'Григорьева', 'Давыдовна', 'Даниловна', 'Денисова', 'Дмитриевна', 'Евгеньевна', 'Егоровна', 'Емельяновна', 'Ефимова', 'Ивановна', 'Игоревна', 'Ильична', 'Иосифовна']


def user_generator():
    out = {
        'gender': bool(randint(0, 1)),
        'date_birthday': f'{randint(1,28)}.{randint(1,12)}.{randint(1900, 2004)}',
        'address': 'Россия, г.Красноярск',
    }
    if out['gender']:
        out['name'] = names_m[randint(0,len(names_m)-1)]
        out['surname'] = last_names[randint(0,len(last_names)-1)]
        out['patronymic'] = partronymics_m[randint(0, len(partronymics_m)-1)]
    else:
        out['name'] = names_w[randint(0, len(names_m) - 1)]
        out['surname'] = last_names[randint(0, len(last_names) - 1)] + 'а'
        out['patronymic'] = partronymics_w[randint(0, len(partronymics_w) - 1)]
    return out

def email_generator():
    return ''.join(choice(string.ascii_lowercase) for _ in range(randint(5, 10))) + '@gmail.com'

def phone_generator():
    return '+7'+str(randint(1000000000, 9999999999))


def user_put():
    req = requests.put('http://127.0.0.1:5000/user/', data=user_generator())
    print(req.text)


def user_post(user_id=''):
    req = requests.post('http://127.0.0.1:5000/user/', data={
        'user_id': user_id
    })
    print(req.text)


def user_del(user_id):
    req = requests.delete('http://127.0.0.1:5000/user/', data={
        'user_id': user_id
    })
    print(req.text)

def user_upd(user_id):
    req = requests.patch('http://127.0.0.1:5000/user/', data={'user_id': user_id, **user_generator()})
    print(req.text)



def phone_put(user_id):
    req = requests.put('http://127.0.0.1:5000/phone/', data={
        'user_id': user_id,
        'type': True,
        'number': phone_generator()
    })
    print(req.text)

def phone_post(phone_id='', user_id=''):
    req = requests.post('http://127.0.0.1:5000/phone/', data={
        'phone_id': phone_id,
        'user_id': user_id
    })
    print(req.text)

def phone_del(phone_id):
    req = requests.delete('http://127.0.0.1:5000/phone/', data={
        'phone_id': phone_id
    })
    print(req.text)

def phone_upd(phone_id):
    req = requests.patch('http://127.0.0.1:5000/phone/', data={'phone_id': phone_id, **phone_generator()})
    print(req.text)



def email_put(user_id):
    req = requests.put('http://127.0.0.1:5000/email/', data={
        'user_id': user_id,
        'type': bool(randint(0,1)),
        'email': email_generator()
    })
    print(req.text)

def email_post(email_id='', user_id=''):
    req = requests.post('http://127.0.0.1:5000/email/', data={
        'email_id': email_id,
        'user_id': user_id
    })
    print(req.text)

def email_del(email_id):
    req = requests.delete('http://127.0.0.1:5000/email/', data={
        'email_id': email_id
    })
    print(req.text)

def email_upd(email_id):
    req = requests.patch('http://127.0.0.1:5000/email/', data={'email_id': email_id, **email_generator()})
    print(req.text)


def make_random_users(num=1000):
    for i in range(num):
        user_put()
        phone_put(i+1)
        email_put(i+1)
    print(f'Created {num} users')

